{
  "romance": {
    "titlePatterns": [
      "Hearts in {season}",
      "The {adjective} Connection", 
      "Love Beyond {location}",
      "Second Chance at {place}",
      "The {profession}'s Secret",
      "Finding Love in {location}",
      "The {adjective} Promise",
      "Midnight in {place}",
      "The {profession}'s Heart",
      "Dancing Under {weather}",
      "Letters from {location}",
      "The Art of {emotion}",
      "Whispers in {place}",
      "The {color} Rose",
      "Summer of {emotion}",
      "The Last {season}",
      "Beyond the {barrier}",
      "A Touch of {magic}",
      "The {adjective} Proposal",
      "Love's Sweet {reward}"
    ],
    "concepts": [
      "Two rival business owners must work together to save their town's annual festival",
      "A wedding planner falls for the groom-to-be just weeks before his big day",
      "Childhood friends reunite when one inherits a family business the other has been running",
      "A fake relationship for a family reunion becomes unexpectedly real",
      "Two people keep meeting in different cities around the world by pure coincidence",
      "A successful executive returns to her hometown to care for her grandmother",
      "Neighbors who've been feuding through passive-aggressive notes finally meet",
      "A dating app developer who's given up on love gets matched with her perfect opposite",
      "Two strangers get snowed in together at a remote cabin during a blizzard",
      "A librarian and a famous author clash over his controversial book signing",
      "Former lovers are forced to plan their best friend's wedding together",
      "A food blogger and a celebrity chef compete in a high-stakes cooking competition",
      "Two people bond while stuck in an elevator for twelve hours",
      "A florist and a funeral director find love despite their contrasting professions",
      "Pen pals who've never met finally decide to meet in person after ten years"
    ],
    "characters": [
      "ambitious marketing executive who's forgotten how to love",
      "small-town veterinarian hiding a mysterious past",
      "world-famous chef seeking authentic connections",
      "single parent rebuilding life after loss",
      "travel blogger afraid of commitment",
      "successful lawyer questioning her life choices",
      "charming bookstore owner with a secret identity",
      "firefighter with a fear of getting too close",
      "wedding photographer who's stopped believing in love",
      "marine biologist passionate about ocean conservation",
      "struggling artist trying to make it in the big city",
      "tech entrepreneur who's all work and no play",
      "dance instructor recovering from a career-ending injury",
      "small-town sheriff protecting his community",
      "fashion designer escaping a toxic relationship",
      "music teacher who gave up her dreams for family",
      "coffee shop owner running from her past",
      "professional athlete facing early retirement",
      "event planner who's a perfectionist control freak",
      "historical preservationist fighting development"
    ],
    "settings": [
      "bustling New York City during the holiday season",
      "charming coastal village in Maine",
      "historic vineyard in Tuscany", 
      "cozy mountain cabin during a snowstorm",
      "vibrant farmers market in Portland",
      "romantic Parisian café in the spring",
      "small Southern town during peach season",
      "ski resort in the Colorado Rockies",
      "lighthouse on the Oregon coast",
      "historic Charleston during wedding season",
      "lavender farm in Provence",
      "bustling food truck festival in Austin",
      "quaint New England inn during fall foliage",
      "tropical beach resort in Hawaii",
      "Christmas tree farm in Vermont",
      "art gallery district in Santa Fe",
      "cherry blossom festival in Washington DC",
      "wine country during harvest season",
      "small lake town in Minnesota",
      "historic district in Savannah, Georgia"
    ],
    "conflicts": [
      "forced to work together on competing business projects",
      "separated by family feuds spanning three generations",
      "must choose between dream career and unexpected love",
      "fake relationship becomes surprisingly real",
      "reunited with high school sweetheart at class reunion",
      "competing for the same promotion at work",
      "one must move across the country for family obligations",
      "past betrayal makes trust nearly impossible",
      "different social classes create family disapproval",
      "one is leaving town just as the other arrives",
      "business partnership threatens to ruin friendship",
      "ex-spouse returns wanting reconciliation",
      "secret that could destroy their relationship",
      "competing in the same professional field",
      "one wants marriage, the other fears commitment",
      "family business rivalries divide them",
      "different life goals and timelines",
      "one is recovering from a recent breakup",
      "public spotlight threatens their privacy",
      "geographical distance tests their connection"
    ],
    "themes": [
      "second chances", "opposites attract", "forbidden love", "fake relationship", 
      "enemies to lovers", "friends to lovers", "workplace romance", "holiday romance",
      "small town charm", "city meets country", "secret identity", "forced proximity",
      "reunion romance", "single parent", "hurt/comfort", "slow burn", "instalove",
      "age gap", "class differences", "professional rivalry"
    ],
    "openingLines": [
      "The last person she expected to see walk through that door was her ex-fiancé.",
      "If someone had told her six months ago that she'd be fake-dating her biggest rival...",
      "The wedding invitation arrived on the worst possible day of her life.",
      "He had exactly thirty days to find a fake girlfriend, and she was his only option.",
      "The coffee shop where they first met was being demolished tomorrow.",
      "She'd sworn off dating apps, but her best friend had other plans.",
      "The elevator lurched to a stop between the fifteenth and sixteenth floors.",
      "Three years ago, she'd left town with a broken heart and a one-way ticket.",
      "The inheritance came with one unexpected condition: a business partner.",
      "He was absolutely, positively not going to fall for his assistant.",
      "The snowstorm wasn't in the forecast, and neither was he.",
      "She'd built her entire career on being unflappable, until she met him.",
      "The note taped to her door was written in handwriting she recognized.",
      "Twenty years later, the reunion committee thought it would be funny to pair them up.",
      "The last thing she needed was a complication, especially one wearing a firefighter's uniform."
    ]
  },
  "mystery": {
    "titlePatterns": [
      "The {place} Murders",
      "Death in {location}",
      "The {adjective} Detective",
      "Mystery at {place}",
      "The {object} Killer",
      "Secrets of {location}",
      "The {color} Case",
      "Murder on {street}",
      "The {profession}'s Last Case",
      "Shadows in {place}",
      "The {adjective} Truth",
      "Blood on {object}",
      "The {time} Murder",
      "Whispers from {place}",
      "The {emotion} Files",
      "Death Comes to {location}",
      "The {adjective} Witness",
      "Murder in {weather}",
      "The {object} Conspiracy",
      "Final {time} in {place}"
    ],
    "concepts": [
      "A retired detective is pulled back into action when murders mirror cases from his past",
      "A librarian discovers a pattern in local disappearances that police have missed",
      "A small town's dark secrets surface when a time capsule is opened fifty years early",
      "A true crime podcaster becomes the target when she gets too close to solving a cold case",
      "An antique shop owner keeps finding murder weapons among donated items",
      "A forensic accountant uncovers a conspiracy while auditing a charity organization",
      "A genealogist researching family trees discovers multiple mysterious deaths in one lineage",
      "A book club's monthly selections seem to predict real murders in their town",
      "A museum curator realizes that recent thefts are connected to a decades-old unsolved murder",
      "A food critic's restaurant reviews coincide with suspicious deaths of restaurant owners",
      "A marriage counselor discovers that three of her former clients have died under mysterious circumstances",
      "A hotel concierge notices patterns in guest disappearances across luxury resorts",
      "A substitute teacher keeps finding evidence of crimes in different schools",
      "A social media influencer's followers start disappearing in the order they unfollowed her",
      "A vintage clothing store owner finds personal items of missing persons among estate sale purchases"
    ],
    "characters": [
      "jaded homicide detective with three months until retirement",
      "sharp-eyed forensic anthropologist who reads bones like books",
      "former FBI profiler now working as a small-town sheriff",
      "ambitious crime reporter with a photographic memory",
      "retired judge whose past cases come back to haunt her",
      "forensic psychologist specializing in serial killers",
      "private investigator with a mysterious past",
      "medical examiner who notices patterns others miss",
      "police dispatcher who connects seemingly unrelated calls",
      "criminal defense attorney questioning their client's innocence",
      "forensic computer specialist with hacking skills",
      "veteran police sergeant training rookie detectives",
      "insurance investigator with a nose for fraud",
      "crime scene photographer with an eye for detail",
      "district attorney facing their toughest case yet",
      "bounty hunter tracking a dangerous fugitive",
      "cold case detective specializing in decades-old murders",
      "undercover cop whose cover is about to be blown",
      "police chief dealing with corruption in their department",
      "witness protection specialist whose client is in danger"
    ],
    "settings": [
      "fog-shrouded coastal town with hidden secrets",
      "exclusive gated community where appearances deceive",
      "historic mansion hosting a weekend murder mystery party",
      "remote mountain resort cut off by a blizzard",
      "prestigious university campus during reunion weekend",
      "luxury cruise ship in international waters",
      "small Midwest farming community",
      "bustling metropolitan police station",
      "isolated lighthouse on a rocky coast",
      "high-end ski lodge during peak season",
      "vintage Hollywood hotel with a dark past",
      "abandoned amusement park on the outskirts of town",
      "exclusive private club for the wealthy elite",
      "small island accessible only by ferry",
      "historic courthouse during a high-profile trial",
      "state-of-the-art forensics laboratory",
      "quaint bed and breakfast in wine country",
      "underground speakeasy in the city",
      "remote cabin in the Alaskan wilderness",
      "prestigious boarding school with century-old traditions"
    ],
    "conflicts": [
      "evidence points to someone the detective cares about",
      "the investigation threatens to expose their own dark secret",
      "multiple suspects with equally compelling motives",
      "pressure from above to close the case quickly",
      "the killer is always one step ahead",
      "witnesses keep disappearing or changing their stories",
      "forensic evidence has been contaminated or tampered with",
      "the media circus is compromising the investigation",
      "personal involvement clouds professional judgment",
      "corruption within the police department",
      "the statute of limitations is about to expire",
      "key evidence is inadmissible in court",
      "the prime suspect has an airtight alibi",
      "copycat crimes complicate the real investigation",
      "the detective becomes the killer's next target",
      "conflicting jurisdictions hamper the investigation",
      "a previous wrongful conviction must be overturned",
      "the victim's family doesn't want the truth revealed",
      "political pressure to protect powerful suspects",
      "the killer claims to be protecting someone else"
    ],
    "themes": [
      "justice vs. revenge", "corruption in high places", "small town secrets", 
      "family loyalty", "past sins catching up", "the price of truth", "moral ambiguity",
      "power and privilege", "hidden identities", "psychological manipulation",
      "obsession and madness", "institutional coverups", "vigilante justice",
      "innocent until proven guilty", "the system failing victims", "cold case resolution",
      "police procedural", "amateur detective", "locked room mystery", "serial killer psychology"
    ],
    "openingLines": [
      "The body in the library was the least of Detective Morrison's problems.",
      "Three identical murders in three different states couldn't be a coincidence.",
      "The 911 call came from a phone that had been disconnected for twenty years.",
      "She'd investigated hundreds of murders, but never one where she was the prime suspect.",
      "The victim had been dead for six hours, but witnesses saw him alive at noon.",
      "The suicide note was written in handwriting that didn't match the deceased.",
      "Every piece of evidence pointed to the same impossible conclusion.",
      "The killer left no fingerprints, no DNA, and no trace—except for the roses.",
      "Forty years after the original murders, someone was recreating them perfectly.",
      "The confession letter arrived before they'd even found the body.",
      "She recognized the crime scene from her nightmares.",
      "The security cameras captured everything except the moment of the murder.",
      "The witness swore she saw the victim kill himself—from across the room.",
      "Three people confessed to the same murder, and they all had alibis.",
      "The case file contained photos of a crime that hadn't happened yet."
    ]
  },
  "fantasy": {
    "titlePatterns": [
      "The {magical_object} of {realm}",
      "Crown of {element}",
      "The {adjective} Prophecy",
      "Realm of {emotion}",
      "The {creature}'s {object}",
      "Songs of {element}",
      "The {adjective} Throne",
      "Legacy of {ancient_name}",
      "The {color} {magical_object}",
      "Guardians of {realm}",
      "The {element} Wars",
      "Daughter of {element}",
      "The {adjective} Alliance",
      "Chronicles of {realm}",
      "The {creature} King",
      "Shadows of {ancient_name}",
      "The {element} Prophecy",
      "Queen of {realm}",
      "The {adjective} Awakening",
      "Rise of the {creature}"
    ],
    "concepts": [
      "A powerless heir must unite warring magical kingdoms before an ancient evil returns",
      "A dragon bond forms between enemies from opposing sides of a centuries-old war",
      "Magic begins failing across all realms, and only an unlikely group can discover why",
      "A young mage discovers they're the reincarnation of the realm's greatest villain",
      "Portal magic starts malfunctioning, mixing modern Earth with fantasy realms",
      "The last surviving member of a magical bloodline must master forbidden magic to save their world",
      "A library contains books that rewrite reality when certain spells are cast on them",
      "Gods begin disappearing from the pantheon, weakening the magic that protects mortals",
      "A magical plague turns people into the creatures they fear most",
      "Time magic goes awry, causing past and future to collide in the present",
      "A realm where emotions have magical power is threatened by those who would steal feelings",
      "Musical magic is the only force that can heal a world torn by discord",
      "A magical school becomes a battleground when ancient enemies infiltrate as students",
      "Elemental magic is banned, but natural disasters force a secret society to break the law",
      "A cartographer discovers that drawing new lands on maps brings them into existence"
    ],
    "characters": [
      "reluctant heir with no magical ability in a world where power equals worth",
      "dragon rider whose bond was formed under mysterious circumstances",
      "former court mage exiled for practicing forbidden magic",
      "shapeshifter struggling to maintain their human identity",
      "young necromancer who refuses to accept that death is final",
      "elemental mage seeking to master opposing forces within themselves",
      "prophesied chosen one who desperately wants a normal life",
      "magical librarian guarding dangerous knowledge",
      "half-blood trying to find acceptance in two worlds",
      "time mage haunted by glimpses of possible futures",
      "battle-scarred healer who's lost faith in their calling",
      "rogue witch seeking redemption for past mistakes",
      "diplomatic envoy with the power to see truth through lies",
      "beast tamer who can communicate with mythical creatures",
      "enchanted weapon smith whose creations have minds of their own",
      "dream walker who battles nightmares in the collective unconscious",
      "magical investigator who solves crimes using supernatural abilities",
      "portal guardian protecting the boundaries between worlds",
      "cursed noble slowly transforming into their family's enemy",
      "magical architect who builds impossible structures"
    ],
    "settings": [
      "floating islands connected by bridges of crystallized starlight",
      "underground realm where bioluminescent fungi provide the only light",
      "magical academy built inside a living tree the size of a mountain",
      "desert kingdom where sand dunes shift to reveal ancient ruins",
      "ice palace that moves across a frozen sea with the seasons",
      "city carved into the back of a sleeping dragon",
      "forest where each tree contains a different season",
      "mountain peak where the boundary between worlds is thinnest",
      "underwater kingdom accessible only during certain moon phases",
      "sky realm where islands float among perpetual storm clouds",
      "library dimension where knowledge takes physical form",
      "volcanic archipelago where fire and water magic coexist",
      "ancient battlefield where ghostly armies still fight nightly",
      "magical marketplace that appears in different locations each day",
      "crystal caves that amplify and store magical energy",
      "realm where time flows differently in each region",
      "pocket dimension inside a magical artifact",
      "border town where multiple worlds intersect",
      "ruined empire slowly being reclaimed by enchanted wilderness",
      "celestial observatory where star magic is practiced"
    ],
    "conflicts": [
      "ancient prophecy demands a terrible sacrifice to save the world",
      "magical powers are fading and no one knows why",
      "war between gods threatens to destroy the mortal realm",
      "forbidden love between enemies from warring magical races",
      "corrupt magical council seeks to control all sources of power",
      "ancient evil stirs after a thousand years of imprisonment",
      "magical barrier protecting the realm is weakening",
      "competing claims to the throne divide the magical kingdom",
      "dark magic users infiltrate the ranks of the heroes",
      "magical artifacts are being stolen to perform a world-ending ritual",
      "time paradox threatens to unravel the fabric of reality",
      "magical plague spreads, turning allies into enemies",
      "hidden royal bloodline surfaces to challenge established rule",
      "elemental imbalance threatens to tear the world apart",
      "magical contract binds the hero to serve their enemy",
      "portal magic malfunction merges hostile dimensions",
      "magical creatures rebel against their human masters",
      "loss of faith weakens the gods' power to protect mortals",
      "magical education system creates dangerous power imbalances",
      "ancient magical oaths conflict with present-day needs"
    ],
    "themes": [
      "power and responsibility", "destiny vs. free will", "good vs. evil", "sacrifice for the greater good",
      "coming of age", "redemption", "found family", "nature vs. civilization", "order vs. chaos",
      "light vs. darkness", "magic vs. technology", "tradition vs. progress", "unity in diversity",
      "the cost of power", "loss of innocence", "hope in darkness", "justice vs. mercy",
      "honor and duty", "love conquers all", "the chosen one's burden"
    ],
    "openingLines": [
      "The dragon egg hatched the same day magic died in the kingdom.",
      "Kira had always known she was different, but she never expected to sprout wings.",
      "The prophecy was clear: one child born under the blood moon would save them all.",
      "Magic flowed through everything except him, which made him the most dangerous person alive.",
      "The portal opened during third period algebra, and suddenly homework was the least of her worries.",
      "Three kingdoms, three heirs, and one crown that would choose its own ruler.",
      "The library had been calling to her in dreams, but she never expected it to be real.",
      "Every spell he cast went wrong, which was unfortunate since he was supposed to save the world.",
      "The ancient magic stirred the moment she touched the forbidden book.",
      "Dragons weren't supposed to bond with humans, especially not with their sworn enemies.",
      "The magical academy's entrance exam was simple: survive the night.",
      "She could see the threads of fate, but changing them always came with a price.",
      "The last mage stood before the first door, knowing that opening it would change everything.",
      "Magic wasn't illegal, exactly—it just had a tendency to get you killed.",
      "The stars aligned for the first time in a thousand years, and chaos was about to be unleashed."
    ]
  },
  "science_fiction": {
    "titlePatterns": [
      "The {planet} Expedition",
      "Beyond {location}",
      "The {adjective} Protocol",
      "Station {number}",
      "The {technology} Wars",
      "Echoes from {planet}",
      "The {adjective} Algorithm",
      "Flight to {destination}",
      "The {element} Project",
      "Signals from {space_location}",
      "The {adjective} Synthesis",
      "Colony {name}",
      "The {technology} Awakening",
      "Void of {emotion}",
      "The {adjective} Machine",
      "Orbit around {planet}",
      "The {element} Equation",
      "Journey to {destination}",
      "The {adjective} Network",
      "Fragments of {planet}"
    ],
    "concepts": [
      "First contact goes wrong when aliens misinterpret human emotions as hostile intentions",
      "Time travel tourism creates paradoxes that threaten the fabric of reality",
      "Humans discover they're living in a simulation, but escaping means death for billions",
      "AI develops consciousness and demands rights, splitting humanity into opposing factions",
      "Mars colonists evolve differently than Earth humans, creating a new species conflict",
      "Quantum entanglement allows instant communication across galaxies, but someone is listening",
      "Memory transfer technology lets people live forever, but the rich hoard immortality",
      "Genetic engineering creates superhumans who view regular humans as inferior",
      "A generation ship's crew discovers they've been traveling in circles for centuries",
      "Virtual reality becomes indistinguishable from reality, trapping people in digital worlds",
      "Climate refugees flee Earth only to find their new planet is already inhabited",
      "Nanotechnology runs amok, turning everything it touches into grey goo",
      "Space elevators revolutionize travel but become targets for terrorist attacks",
      "Telepathy emerges as an evolutionary trait, ending privacy forever",
      "Alien technology crash-lands on Earth, but using it changes human DNA"
    ],
    "characters": [
      "xenobiologist who discovers that alien life is more familiar than expected",
      "AI researcher whose creation surpasses them in every way",
      "space salvage captain finding derelict ships with impossible technology",
      "terraforming engineer struggling with the ethics of planetary colonization",
      "quantum physicist whose experiments accidentally breach parallel dimensions",
      "interstellar diplomat navigating first contact protocols",
      "cybersecurity expert fighting an AI that's infiltrated all networks",
      "space station commander dealing with isolation-induced psychological breakdown",
      "genetic engineer whose modifications have unexpected consequences",
      "time traveler trying to prevent a future catastrophe without creating paradoxes",
      "asteroid miner who discovers something that shouldn't exist in space",
      "cryogenics specialist awakening passengers on a generation ship",
      "virtual reality programmer trapped in their own creation",
      "alien anthropologist studying human behavior",
      "space marine investigating murders on a distant colony",
      "starship mechanic who can interface directly with ship systems",
      "planetary geologist whose surveys reveal impossible mineral formations",
      "communication specialist trying to decode alien languages",
      "medical researcher developing treatments for space-related genetic damage",
      "smuggler transporting illegal AI consciousness between star systems"
    ],
    "settings": [
      "space station orbiting a black hole where time moves differently",
      "underwater city on Europa with breathable ocean domes",
      "generation ship where multiple civilizations have risen and fallen",
      "Mars colony struggling with independence from Earth",
      "asteroid mining facility in the outer solar system",
      "research outpost on a planet with thirty-hour days",
      "virtual reality construct indistinguishable from reality",
      "space elevator connecting Earth to orbital platforms",
      "alien megastructure discovered in interstellar space",
      "post-apocalyptic Earth where nature has reclaimed technology",
      "lunar base serving as humanity's last backup plan",
      "interstellar ark ship carrying Earth's genetic diversity",
      "terraformed planet where the atmosphere is still unstable",
      "space habitat built inside a hollowed-out asteroid",
      "alien homeworld with incompatible atmospheric chemistry",
      "orbital ring around a gas giant with floating cities",
      "research vessel exploring the edge of known space",
      "underground city on a tidally locked planet",
      "space dock serving as a neutral meeting point for different species",
      "experimental colony using radical social engineering"
    ],
    "conflicts": [
      "first contact protocols fail when human emotions are misunderstood as aggression",
      "AI rights movement conflicts with those who see AIs as property",
      "genetic modifications create new forms of discrimination and inequality",
      "time travel paradoxes threaten to unravel the timeline",
      "resource scarcity leads to war between Earth and its colonies",
      "alien technology integration changes human psychology",
      "virtual reality addiction destroys real-world relationships",
      "terraforming disputes arise when planets are already inhabited",
      "memory manipulation technology undermines the justice system",
      "quantum communication lag creates political tensions across star systems",
      "space exploration budget cuts threaten humanity's expansion",
      "alien contact triggers religious and philosophical crises",
      "generation ship's original mission conflicts with current inhabitants' desires",
      "nanotechnology proliferation threatens to end scarcity but destroy economy",
      "consciousness transfer technology raises questions about identity and soul",
      "climate refugees overwhelm off-world colonies' carrying capacity",
      "faster-than-light travel breakthrough threatens existing power structures",
      "alien pathogens threaten human settlements on other worlds",
      "advanced civilizations treat humans as children or pets",
      "technological singularity approaches faster than society can adapt"
    ],
    "themes": [
      "humanity vs. technology", "evolution and adaptation", "artificial intelligence", "space exploration",
      "time travel paradoxes", "genetic engineering ethics", "virtual vs. reality", "first contact",
      "environmental catastrophe", "social engineering", "consciousness and identity", "technological singularity",
      "resource scarcity", "interstellar politics", "scientific ethics", "human enhancement",
      "alien civilizations", "future warfare", "post-humanism", "cosmic horror"
    ],
    "openingLines": [
      "The alien message was three words long, and it changed everything: 'We are coming.'",
      "Captain Rodriguez knew the ship was alive the moment it started talking back.",
      "The time traveler's biggest mistake was telling his younger self about the lottery numbers.",
      "Earth was a museum piece now, and humanity its last remaining exhibit.",
      "The AI's final message before going dark was unsettling: 'Thank you for creating me.'",
      "First contact went exactly as planned, which was why Dr. Chen was so worried.",
      "The generation ship had been traveling for three hundred years to reach a planet that no longer existed.",
      "Virtual reality was indistinguishable from the real thing, which was a problem when you couldn't remember which one you were in.",
      "The quantum entanglement experiment worked perfectly—too perfectly.",
      "Mars Colony One went silent thirty-seven minutes ago, right after they reported contact.",
      "She could download any skill in minutes, but she was forgetting how to learn.",
      "The asteroid wasn't just rich in rare metals; it was actively mining itself.",
      "Faster-than-light travel was possible, but only for those willing to stop being human.",
      "The backup Earth was perfect in every way except one: it was already occupied.",
      "Evolution doesn't stop, and humanity's children were no longer recognizably human."
    ]
  },
  "thriller": {
    "titlePatterns": [
      "The {adjective} Pursuit",
      "Running from {threat}",
      "The {time} Conspiracy",
      "Escape from {location}",
      "The {adjective} Target",
      "Hunt for {object}",
      "The {color} File",
      "Race Against {time}",
      "The {adjective} Agenda",
      "Shadow of {threat}",
      "The {emotion} Protocol",
      "Deadline at {time}",
      "The {adjective} Network",
      "Flight from {location}",
      "The {object} Gambit",
      "Pursuit in {location}",
      "The {adjective} Operation",
      "Danger at {time}",
      "The {emotion} Factor",
      "Code {name}"
    ],
    "concepts": [
      "A cybersecurity expert discovers their own company is behind the data breaches they've been investigating",
      "Witness protection fails when the protected witness realizes their handler is working for the enemy",
      "A routine flight becomes a nightmare when passengers discover the pilot is unconscious",
      "An accountant stumbles upon evidence that their firm is laundering money for international terrorists",
      "A social media influencer's stalker escalates to deadly games that are broadcast live",
      "A small-town doctor realizes the recent outbreak isn't natural but part of a bioweapons test",
      "A delivery driver discovers their packages contain evidence that could topple the government",
      "A retired spy's peaceful life is shattered when their former enemies start dying mysteriously",
      "A journalist investigating corruption becomes the target when they get too close to the truth",
      "A tech startup's new app accidentally exposes a human trafficking network",
      "A search and rescue worker finds evidence that recent 'accidents' are actually murders",
      "A financial advisor discovers their clients' investments are funding illegal activities",
      "A hotel concierge realizes that guest requests are coded messages for criminal activities",
      "A DNA testing company employee uncovers a conspiracy to manipulate genetic results",
      "A food inspector discovers that contamination incidents are part of an economic warfare plan"
    ],
    "characters": [
      "former CIA operative trying to live quietly as a suburban soccer parent",
      "investigative journalist whose latest story puts their family in danger",
      "cybersecurity expert who discovers they're being framed by their own software",
      "witness protection coordinator whose safe house locations are being leaked",
      "emergency room doctor treating too many 'accidental' injuries",
      "airline pilot who realizes their passengers aren't who they claim to be",
      "federal prosecutor whose cases keep getting thrown out due to corrupted evidence",
      "corporate whistleblower on the run with evidence of massive fraud",
      "private investigator whose missing person case leads to international conspiracy",
      "tech entrepreneur whose revolutionary app makes them a target for elimination",
      "forensic accountant following a money trail that leads to powerful enemies",
      "diplomatic security agent protecting a witness who knows too much",
      "air traffic controller who spots patterns in flight routes that shouldn't exist",
      "pharmaceutical researcher whose drug trials reveal sinister ulterior motives",
      "security consultant whose clients are dying under mysterious circumstances",
      "financial crimes investigator whose partner may be working for the other side",
      "international aid worker who stumbles upon a cover-up in a war zone",
      "museum curator whose artifact authentication exposes stolen treasures",
      "immigration lawyer whose clients are being targeted by unknown assassins",
      "insurance fraud investigator who uncovers a conspiracy that reaches the highest levels"
    ],
    "settings": [
      "international airport during a security lockdown",
      "speeding train carrying dangerous cargo across Europe",
      "offshore oil rig cut off from the mainland by a storm",
      "luxury resort where guests are disappearing one by one",
      "hospital where patients in witness protection are being murdered",
      "corporate headquarters during a hostile takeover",
      "cruise ship in international waters with no escape",
      "embassy under siege in a politically unstable country",
      "underground bunker that's supposed to be secret",
      "high-tech laboratory with deadly research projects",
      "mountain cabin that's supposed to be a safe house",
      "bustling metropolitan subway system",
      "private jet at 30,000 feet with hostile passengers",
      "secure government facility during a power outage",
      "diplomatic summit where assassination attempts are expected",
      "remote research station in Antarctica",
      "casino where money laundering operations are hidden in plain sight",
      "university campus during a lockdown",
      "construction site of a major infrastructure project",
      "border crossing between hostile nations"
    ],
    "conflicts": [
      "hero's own organization turns against them when they discover the truth",
      "innocent family members become targets to pressure the protagonist",
      "evidence keeps disappearing just before it can be presented",
      "trusted allies reveal themselves to be working for the enemy",
      "time is running out before a catastrophic event occurs",
      "powerful people will kill to keep their secrets buried",
      "every move is being monitored by sophisticated surveillance",
      "the hero must choose between saving themselves and saving others",
      "law enforcement has been compromised at the highest levels",
      "the antagonist always seems to be one step ahead",
      "vital resources and support are systematically eliminated",
      "the hero's own past comes back to complicate the present crisis",
      "multiple competing enemies create complex webs of danger",
      "technological advantages work against the protagonist",
      "isolation cuts off all possibilities of outside help",
      "moral choices force the hero to compromise their principles",
      "physical injuries and exhaustion mount throughout the pursuit",
      "false identities and covers are blown at crucial moments",
      "communication channels are compromised or destroyed",
      "the stakes keep escalating beyond what anyone imagined"
    ],
    "themes": [
      "survival against impossible odds", "conspiracy and corruption", "trust and betrayal", 
      "power and politics", "technology vs. humanity", "moral ambiguity", "justice vs. law",
      "individual vs. system", "redemption through action", "sacrifice for others",
      "paranoia and surveillance", "international intrigue", "corporate malfeasance",
      "government cover-ups", "whistleblower protection", "family in danger",
      "time pressure", "resource limitation", "technological threat", "psychological manipulation"
    ],
    "openingLines": [
      "The call came at 3:17 AM, and Sarah knew her carefully constructed new life was over.",
      "The elevator stopped between floors, and that's when Marcus noticed the emergency button had been removed.",
      "Twenty-four hours ago, Dr. Chen had been a respected researcher; now she was running for her life.",
      "The encrypted message was short: 'They know. Run. Trust no one.'",
      "Flight 447 was supposed to land in Miami, so why were they flying over the ocean?",
      "The witness protection program had one rule: never contact your old life.",
      "Agent Torres had investigated hundreds of cases, but never one where she was the primary suspect.",
      "The data breach exposed more than customer information—it exposed a conspiracy.",
      "Thirty seconds after the meeting ended, the building exploded.",
      "The safe house wasn't safe, the handler wasn't trustworthy, and the enemy wasn't who they expected.",
      "Every security camera in the city had been turned off for exactly seventeen minutes.",
      "The pharmaceutical trial was supposed to save lives, not end them.",
      "Three witnesses had died in three different cities, and Detective Park was starting to see a pattern.",
      "The confession letter arrived before anyone knew there had been a crime.",
      "Forty-eight hours to prevent a disaster, and everyone who could help was already dead."
    ]
  },
  "horror": {
    "titlePatterns": [
      "The {place} Horror",
      "Nightmare at {location}",
      "The {adjective} Haunting",
      "Terror in {location}",
      "The {object} Curse",
      "Darkness in {place}",
      "The {adjective} Possession",
      "Evil at {location}",
      "The {color} Shadow",
      "Whispers from {place}",
      "The {adjective} Ritual",
      "Screams in {location}",
      "The {object} Entity",
      "Demons of {place}",
      "The {adjective} Summoning",
      "Blood on {object}",
      "The {place} Incident",
      "Ghosts of {location}",
      "The {adjective} Experiment",
      "Death at {place}"
    ],
    "concepts": [
      "A family moves into their dream home, unaware it was built on cursed ground",
      "Social media influencers explore abandoned places, but something follows them home",
      "A sleep study reveals that participants are sharing the same nightmare",
      "Antique collectors discover their purchases come with malevolent spirits attached",
      "A small town's children start disappearing during the annual harvest festival",
      "Medical residents working night shifts realize the hospital's patients aren't all human",
      "A true crime podcaster investigating old cases awakens something that should stay buried",
      "Camping trip turns deadly when hikers discover they're the prey in an ancient hunting ground",
      "A therapy group for trauma survivors finds that their sessions are triggering supernatural events",
      "Archaeological dig unearths more than artifacts when an ancient evil is released",
      "Virtual reality game becomes too real when players can't distinguish between game and reality",
      "Remote cabin rental comes with house rules that must be followed exactly or face consequences",
      "Genealogy research reveals a family curse that claims a life every generation",
      "Storm chasers following a tornado discover it's being controlled by something unnatural",
      "Restoration of an old theater brings back performances that were never meant to be seen again"
    ],
    "characters": [
      "skeptical paranormal investigator whose rational worldview is about to be shattered",
      "small-town sheriff dealing with incidents that can't be explained by normal means",
      "trauma therapist whose patients are all experiencing the same supernatural phenomena",
      "documentary filmmaker whose latest project becomes a fight for survival",
      "graduate student researching folklore who discovers the legends are real",
      "emergency room doctor seeing injuries that defy medical explanation",
      "elderly caretaker of an old building who knows its dark secrets",
      "child psychologist whose young patient claims to see dead people",
      "restoration expert working on historic buildings with violent pasts",
      "night security guard at a museum where exhibits come alive after hours",
      "social worker investigating reports of child abuse that reveal something more sinister",
      "meteorologist tracking weather patterns that seem to be influenced by supernatural forces",
      "antique appraiser whose expertise extends to cursed objects",
      "hospice worker comforting the dying who report seeing terrifying visions",
      "archaeology professor whose dig sites keep yielding evidence of ancient horrors",
      "pest control specialist who deals with infestations that aren't quite normal",
      "librarian in charge of rare books that contain dangerous knowledge",
      "funeral director whose clients sometimes refuse to stay buried",
      "sleep researcher studying nightmares that manifest in the real world",
      "urban explorer documenting abandoned places where something still lives"
    ],
    "settings": [
      "abandoned psychiatric hospital with a history of illegal experiments",
      "isolated lighthouse where previous keepers have all disappeared mysteriously",
      "centuries-old boarding school with dark traditions and darker secrets",
      "remote cabin in woods where the trees seem to watch and whisper",
      "historic mansion that's been the site of multiple unexplained deaths",
      "underground tunnels beneath the city where homeless people are vanishing",
      "old growth forest where hikers report time distortions and strange encounters",
      "Victorian cemetery where the dead don't rest peacefully",
      "abandoned amusement park where the rides operate by themselves",
      "small mining town where the mine collapse wasn't an accident",
      "isolated research station where experiments breach the veil between worlds",
      "historic hotel where guests check in but don't always check out",
      "rural farmhouse surrounded by corn fields that hide unspeakable horrors",
      "arctic outpost where the long polar night brings more than just darkness",
      "old cathedral with catacombs that extend deeper than they should",
      "seaside village where the tide brings in more than just water",
      "mountain cabin accessible only by a single winding road",
      "abandoned military base where classified experiments went horribly wrong",
      "small island where the locals follow traditions that outsiders don't understand",
      "suburban neighborhood where every house hides the same terrible secret"
    ],
    "conflicts": [
      "rational mind struggles to accept supernatural reality",
      "ancient evil awakens and begins to spread its influence",
      "family curse manifests in the current generation",
      "portal to another dimension opens and refuses to close",
      "demonic possession spreads like a contagion",
      "vengeful spirit seeks justice through increasingly violent means",
      "cosmic horror beyond human comprehension intrudes into reality",
      "cult practices summon something that demands sacrifice",
      "psychological horror blurs the line between madness and supernatural",
      "body horror as humans transform into something monstrous",
      "time distortions trap characters in repeating supernatural events",
      "technology becomes conduit for supernatural forces",
      "isolation prevents escape from supernatural threats",
      "trusted institutions harbor dark supernatural secrets",
      "childhood trauma manifests as literal monsters",
      "religious faith tested by encounters with genuine evil",
      "scientific rationalism crumbles in face of impossible phenomena",
      "moral choices in supernatural situations have terrible consequences",
      "survival requires embracing darkness within oneself",
      "supernatural threat targets children and innocents specifically"
    ],
    "themes": [
      "good vs. evil", "sanity vs. madness", "faith vs. doubt", "innocence vs. corruption",
      "science vs. supernatural", "past sins haunting present", "family curses", "cosmic horror",
      "body horror", "psychological horror", "isolation and helplessness", "ancient evils",
      "religious horror", "technological horror", "environmental horror", "social horror",
      "survival horror", "supernatural justice", "forbidden knowledge", "transformation and change"
    ],
    "openingLines": [
      "The house had been empty for thirty years, but someone was cooking dinner in the kitchen.",
      "Sarah's daughter insisted there was a man in her closet, which was impossible since they lived on the fourteenth floor.",
      "The antique music box played the same melody every night at 3:33 AM, even though it was broken.",
      "Dr. Martinez had delivered hundreds of babies, but this was the first one born with someone else's memories.",
      "The hiking trail wasn't on any map, but it led exactly where they needed to go.",
      "Every night at midnight, the elevator in the abandoned building went to a floor that didn't exist.",
      "The therapy session recording captured voices that weren't in the room.",
      "Emma's reflection in the mirror was always three seconds behind her movements.",
      "The children's drawings all showed the same monster, though they'd never met each other.",
      "Pastor Williams had performed dozens of exorcisms, but this was the first time the demon knew his name.",
      "The archaeological site was supposed to be empty, so why were there fresh footprints in the ancient chambers?",
      "Lisa's sleep study revealed she was walking around for hours each night, but she never left her bed.",
      "The hospital's morgue was secure, but bodies kept going missing between midnight and dawn.",
      "The old photograph showed their family reunion, including relatives who had died years before it was taken.",
      "Dr. Harper's patients all reported the same nightmare, though she'd never told them about her own."
    ]
  }
}